#+TITLE: Container Image Hash To Tag

* Understanding the data
#+BEGIN_SRC shell
cat /tmp/resource_and_hash_distinct_list.json | jq -s .[0]
#+END_SRC

#+RESULTS:
#+begin_example
{
  "cs_referer": "https://k8s.gcr.io/v2/pause/blobs/sha256:2a060e2e7101d419352bf82c613158587400be743482d9a537ec4a9d1b4eb93c",
  "resource": [
    "pause"
  ],
  "hash_no": [
    "2a060e2e7101d419352bf82c613158587400be743482d9a537ec4a9d1b4eb93c"
  ]
}
#+end_example

** Checkout stp's layerMapper branch of k8s.io
#+BEGIN_SRC shell
cd ~/kubernetes/k8s.io
git remote add stp-ip https://github.com/stp-ip/k8s.io
git fetch stp-ip
git checkout layerMapper
#+END_SRC

#+RESULTS:
#+begin_example
Branch 'layerMapper' set up to track remote branch 'layerMapper' from 'stp-ip'.
#+end_example

** Running the first hash number
#+BEGIN_SRC shell
HASH=$(cat /tmp/resource_and_hash_distinct_list.json | jq -s -r .[0].hash_no[0])
cd ~/kubernetes/k8s.io/metrics/access-logs/poc-layer-mapper
bash ./matcher.sh $HASH
#+END_SRC

#+RESULTS:
#+begin_example
====
Layer:2a060e2e7101d419352bf82c613158587400be743482d9a537ec4a9d1b4eb93c
Repos
  kubernetes/pause-arm64
  pause-arm64

Tags
  kubernetes/pause-arm64:3.2/amd64
  pause-arm64:3.2/amd64

#+end_example

